org/notes/ostep.org
#+TITLE: OSTEP - Book Club

Schedule: https://eatonphil.com/2026-ostep.html

Homepage: https://pages.cs.wisc.edu/~remzi/OSTEP/
Code: https://github.com/remzi-arpacidusseau/ostep-code
Homework: https://github.com/remzi-arpacidusseau/ostep-homework
Projects: https://github.com/remzi-arpacidusseau/ostep-projects

* Introduction

In a socratic fashion, the first chapter is a dialogue between a /Professor/ and a /Student/ where the key ideas and how best to learn from the book is talked about.

The three easy pieces refer to /virtualization/, /concurrency/ and /persistence/. These ideas will teach one how an OS works, how it decides what program to run next, how it handles memory overload in a virtual memory system, how virtual machine monitors work, how it manages information on disks etc.

The next chapter is an introduction to the three pieces with illustrative examples and how OS takes physical /resources/, /virtualizes/ them, handles /concurrency/ and stores files /persistently/. The goal in designing such a system is to provide high /performance/ or to /minimize overheads/ (extra time or space) of the OS. Furthermore, it should also offer /protection/ (isolation) between applications, OS and the application while being /reliable/.

Then the book talks abouts execution of programs and tries to define the operating system.

A running program executes instructions. The processor /fetches/ an instruction from memory, /decodes/ it (find out what instruction), and /executes/ it; then moves on to the next instruction until the program finishes. The body of software allowing the computer to manage running of various programs to ensure they run correctly and efficiently is known as the /Operating System/.

To make it easier to manage resources of the system OS takes the /physical/ resource (CPU, memory or disk) and transforms it into a /virtual/ form, giving the OS the nickname /virtual machine/ or /resource manager/. The first part of the book aims to deal with *how* virtualization is done.

The chapter ends with a history of how operating systems were developed from early libraries to multiprogramming to PCs running DOS, linux and macOS.

** CPU Virtualization

#+name: include-common
#+begin_src C
#ifndef __common_h__
#define __common_h__

#include <sys/time.h>
#include <sys/stat.h>
#include <assert.h>

double GetTime() {
    struct timeval t;
    int rc = gettimeofday(&t, NULL);
    assert(rc == 0);
    return (double) t.tv_sec + (double) t.tv_usec/1e6;
}

// Repeatedly checks time and returns once 1s has passed.
void Spin(int howlong) {
    double t = GetTime();
    while ((GetTime() - t) < (double) howlong)
	; // do nothing in loop
}

#endif // __common_h__
#+end_src

#+begin_src C :noweb no-export :tangle cpu.c
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include <sys/time.h>
<<include-common>>

int main(int argc, char *argv[]) {
    if (argc != 2) {
        fprintf(stderr, "usage: cpu <string>\n");
        exit(1);
    }
    char *str = argv[1];
    setbuf(stdout, NULL); // disable buffering
    double start = GetTime();
    while(GetTime() - start < 5.0) {
        Spin(1);
        printf("(%d) %s\n", getpid(), str);
    }
    return 0;
}
#+end_src

Compiling and executing the above gives the result:

#+begin_src sh :results output :exports both
gcc -o cpu cpu.c -I.
./cpu "A" & ./cpu "B" &
wait
#+end_src

#+RESULTS[2937e45d6cfe1226b2984535645f6c3de942d9c0]:
#+begin_example
A
B
A
B
A
B
A
B
A
B
#+end_example

Even though there's only one processor, the execution of the two programs ~./cpu "A"~ and ~./cpu "B"~ seems to be happening at the same time, this is because of /CPU virtualization/. But for two programs to run simultaneously, the OS needs to have a /policy/ to decide which should run.

