docs/notes/ostep.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OSTEP - Book Club</title>
<meta name="author" content="Tak" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='/css/stylesheet.css'>
</head>
<body>
<div id="nav" class="status">
<a href='/'>bacchanalian madness</a><a href='/rss.xml'>
    <button id='rss-button' aria-label='Get RSS feed' type='button'>
      <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 448 512' fill='currentColor'>
        <path d='M128.081 415.959c0 35.369-28.672 64.041-64.041 64.041S0 451.328 0 415.959s28.672-64.041 64.041-64.041 64.04 28.673 64.04 64.041zm175.66 47.25c-8.354-154.6-132.185-278.587-286.95-286.95C7.656 175.765 0 183.105 0 192.253v48.069c0 8.415 6.49 15.472 14.887 16.018 111.832 7.284 201.473 96.702 208.772 208.772.547 8.397 7.604 14.887 16.018 14.887h48.069c9.149.001 16.489-7.655 15.995-16.79zm144.249.288C439.596 229.677 251.465 40.445 16.503 32.01 7.473 31.686 0 38.981 0 48.016v48.068c0 8.625 6.835 15.645 15.453 15.999 191.179 7.839 344.627 161.316 352.465 352.465.353 8.618 7.373 15.453 15.999 15.453h48.068c9.034-.001 16.329-7.474 16.005-16.504z'></path>
      </svg>
    </button>
  </a><button id='dark-mode-button' aria-label='Toggle Dark Mode' type='button'>
    <svg id='moon-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor'>
      <path d='M17.293 13.293A8 8 0 016.707 2.707a8.001 8.001 0 1010.586 10.586z'></path>
    </svg>
    <svg id='sun-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor' style='display: none;'>
      <path d='M10 2a1 1 0 011 1v1a1 1 0 11-2 0V3a1 1 0 011-1zm4 8a4 4 0 11-8 0 4 4 0 018 0zm-.464 4.95l.707.707a1 1 0 001.414-1.414l-.707-.707a1 1 0 00-1.414 1.414zm2.12-10.607a1 1 0 010 1.414l-.706.707a1 1 0 11-1.414-1.414l.707-.707a1 1 0 011.414 0zM17 11a1 1 0 100-2h-1a1 1 0 100 2h1zm-7 4a1 1 0 011 1v1a1 1 0 11-2 0v-1a1 1 0 011-1zM5.05 6.464A1 1 0 106.465 5.05l-.708-.707a1 1 0 00-1.414 1.414l.707.707zm1.414 8.486l-.707.707a1 1 0 01-1.414-1.414l.707-.707a1 1 0 011.414 1.414zM4 11a1 1 0 100-2H3a1 1 0 000 2h1z' fill-rule='evenodd' clip-rule='evenodd'></path>
    </svg>
  </button>
</div>
<div id="content" class="content">
<header>
<h1 class="title">OSTEP - Book Club</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9d61927">Introduction</a></li>
</ul>
</div>
</nav>
<p>Schedule: <a href="https://eatonphil.com/2026-ostep.html">https://eatonphil.com/2026-ostep.html</a>
</p>

<p>Homepage: <a href="https://pages.cs.wisc.edu/~remzi/OSTEP/">https://pages.cs.wisc.edu/~remzi/OSTEP/</a>
Code: <a href="https://github.com/remzi-arpacidusseau/ostep-code">https://github.com/remzi-arpacidusseau/ostep-code</a>
Homework: <a href="https://github.com/remzi-arpacidusseau/ostep-homework">https://github.com/remzi-arpacidusseau/ostep-homework</a>
Projects: <a href="https://github.com/remzi-arpacidusseau/ostep-projects">https://github.com/remzi-arpacidusseau/ostep-projects</a>
</p>
<div id="outline-container-org9d61927" class="outline-2">
<h2 id="org9d61927">Introduction</h2>
<div class="outline-text-2" id="text-org9d61927">
<p>In a socratic fashion, the first chapter is a dialogue between a <i>Professor</i> and a <i>Student</i> where the key ideas and how best to learn from the book is talked about.
</p>

<p>The three easy pieces refer to <i>virtualization</i>, <i>concurrency</i> and <i>persistence</i>. These ideas will teach one how an OS works, how it decides what program to run next, how it handles memory overload in a virtual memory system, how virtual machine monitors work, how it manages information on disks etc.
</p>

<p>The next chapter is an introduction to the three pieces with illustrative examples and how OS takes physical <i>resources</i>, <i>virtualizes</i> them, handles <i>concurrency</i> and stores files <i>persistently</i>. The goal in designing such a system is to provide high <i>performance</i> or to <i>minimize overheads</i> (extra time or space) of the OS. Furthermore, it should also offer <i>protection</i> (isolation) between applications, OS and the application while being <i>reliable</i>.
</p>

<p>Then the book talks abouts execution of programs and tries to define the operating system.
</p>

<p>A running program executes instructions. The processor <i>fetches</i> an instruction from memory, <i>decodes</i> it (find out what instruction), and <i>executes</i> it; then moves on to the next instruction until the program finishes. The body of software allowing the computer to manage running of various programs to ensure they run correctly and efficiently is known as the <i>Operating System</i>.
</p>

<p>To make it easier to manage resources of the system OS takes the <i>physical</i> resource (CPU, memory or disk) and transforms it into a <i>virtual</i> form, giving the OS the nickname <i>virtual machine</i> or <i>resource manager</i>. The first part of the book aims to deal with <b>how</b> virtualization is done.
</p>

<p>The chapter ends with a history of how operating systems were developed from early libraries to multiprogramming to PCs running DOS, linux and macOS.
</p>
</div>
<div id="outline-container-orgefcaad0" class="outline-3">
<h3 id="orgefcaad0">CPU Virtualization</h3>
<div class="outline-text-3" id="text-orgefcaad0">
<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#if</span><span class="font-lock-preprocessor-face font-lock-negation-char-face">n</span><span class="font-lock-preprocessor-face">def</span> __common_h__
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-variable-name-face">__common_h__</span>

<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/time.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/stat.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;assert.h&gt;</span>

<span class="font-lock-type-face">double</span> <span class="font-lock-function-name-face">GetTime</span>() {
    <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">timeval</span> <span class="font-lock-variable-name-face">t</span>;
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = gettimeofday(&amp;t, <span class="font-lock-constant-face">NULL</span>);
    assert(rc == 0);
    <span class="font-lock-keyword-face">return</span> (<span class="font-lock-type-face">double</span>) t.tv_sec + (<span class="font-lock-type-face">double</span>) t.tv_usec/1e6;
}

<span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Repeatedly checks time and returns once 1s has passed.
</span><span class="font-lock-type-face">void</span> <span class="font-lock-function-name-face">Spin</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">howlong</span>) {
    <span class="font-lock-type-face">double</span> <span class="font-lock-variable-name-face">t</span> = GetTime();
    <span class="font-lock-keyword-face">while</span> ((GetTime() - t) &lt; (<span class="font-lock-type-face">double</span>) howlong)
        ; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">do nothing in loop
</span>}

<span class="font-lock-preprocessor-face">#endif</span> <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">__common_h__</span></code></pre>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;assert.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/time.h&gt;</span>
&lt;&lt;include-common&gt;&gt;

<span class="font-lock-type-face">int</span> main(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-keyword-face">if</span> (argc != 2) {
        fprintf(stderr, <span class="font-lock-string-face">"usage: cpu &lt;string&gt;\n"</span>);
        exit(1);
    }
    <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">str</span> = argv[1];
    setbuf(stdout, <span class="font-lock-constant-face">NULL</span>); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">disable buffering
</span>    <span class="font-lock-type-face">double</span> <span class="font-lock-variable-name-face">start</span> = GetTime();
    <span class="font-lock-keyword-face">while</span>(GetTime() - start &lt; 5.0) {
        Spin(1);
        printf(<span class="font-lock-string-face">"(%d) %s\n"</span>, getpid(), str);
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<p>Compiling and executing the above gives the result:
</p>

<pre class="src src-sh"><code>gcc -o cpu cpu.c -I.
./cpu <span class="font-lock-string-face">"A"</span> &amp; ./cpu <span class="font-lock-string-face">"B"</span> &amp;
<span class="font-lock-builtin-face">wait</span></code></pre>

<details>
<summary>Output</summary>
<pre class="example" id="orgbb987e1">
A
B
A
B
A
B
A
B
A
B
</pre>

</details><p>Even though there&rsquo;s only one processor, the execution of the two programs <code>./cpu "A"</code> and <code>./cpu "B"</code> seems to be happening at the same time, this is because of <i>CPU virtualization</i>. But for two programs to run simultaneously, the OS needs to have a <i>policy</i> to decide which should run.
</p>
</div>
</div>
