org/notes/ostep.org
** Memory Virtualization

Physical memory is just an array of bytes; to /read/ or /write/ memory, an /address/ must be specified to access the data there.

#+begin_src C :noweb no-export :tangle mem.c
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
<<include-common>>

int main(int argc, char *argv[]) {
    int *p = malloc(sizeof(int)); // memory allocation
    assert(p != NULL);
    printf("(%d) address pointed to by p -> %p\n", getpid(), p); // mem addr
    *p = 0; // write 0 to location specified by memory address
    double start = GetTime();
    setbuf(stdout, NULL); // disable buffering
    while(GetTime() - start < 5.0) {
        Spin(1);
        *p = *p + 1; // update value at the location by 1
        printf("(%d) p => %d addr -> %p\n", getpid(), *p, p);
    }
    return 0;
}
#+end_src

#+begin_src sh :results output :exports both
gcc -o mem mem.c -I.
./mem & ./mem &
wait
#+end_src

#+RESULTS[3d49e56fe2926dcfc821385d39b77013a5b9cf64]:
#+begin_example
(19998) address pointed to by p -> 0x1047cd830
(19997) address pointed to by p -> 0x10263d830
(19997) p => 1 addr -> 0x10263d830
(19998) p => 1 addr -> 0x1047cd830
(19997) p => 2 addr -> 0x10263d830
(19998) p => 2 addr -> 0x1047cd830
(19997) p => 3 addr -> 0x10263d830
(19998) p => 3 addr -> 0x1047cd830
(19997) p => 4 addr -> 0x10263d830
(19998) p => 4 addr -> 0x1047cd830
(19997) p => 5 addr -> 0x10263d830
(19998) p => 5 addr -> 0x1047cd830
#+end_example

In the textbook example, for both instances of the program, the memory was allocated to the same address, this was used to illustrate that each running program has its own private memory (*memory virtualization*, private /address space/ that gets mapped to physical memory) rather than sharing physical memory with other programs.

However for security purposes, ~macOS~ has enabled ~address-space layout randomization~ (ASLR) hence the different addresses for the two processes.

