docs/notes/ostep.html
<div id="outline-container-org93c9af6" class="outline-3">
<h3 id="org93c9af6">Memory Virtualization</h3>
<div class="outline-text-3" id="text-org93c9af6">
<p>Physical memory is just an array of bytes; to <i>read</i> or <i>write</i> memory, an <i>address</i> must be specified to access the data there.
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
&lt;&lt;include-common&gt;&gt;

<span class="font-lock-type-face">int</span> main(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-type-face">int</span> *<span class="font-lock-variable-name-face">p</span> = malloc(<span class="font-lock-keyword-face">sizeof</span>(<span class="font-lock-type-face">int</span>)); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">memory allocation
</span>    assert(p != <span class="font-lock-constant-face">NULL</span>);
    printf(<span class="font-lock-string-face">"(%d) address pointed to by p -&gt; %p\n"</span>, getpid(), p); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">mem addr
</span>    *p = 0; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">write 0 to location specified by memory address
</span>    <span class="font-lock-type-face">double</span> <span class="font-lock-variable-name-face">start</span> = GetTime();
    setbuf(stdout, <span class="font-lock-constant-face">NULL</span>); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">disable buffering
</span>    <span class="font-lock-keyword-face">while</span>(GetTime() - start &lt; 5.0) {
        Spin(1);
        *p = *p + 1; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">update value at the location by 1
</span>        printf(<span class="font-lock-string-face">"(%d) p =&gt; %d addr -&gt; %p\n"</span>, getpid(), *p, p);
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="src src-sh"><code>gcc -o mem mem.c -I.
./mem &amp; ./mem &amp;
<span class="font-lock-builtin-face">wait</span></code></pre>

<details>
<summary>Output</summary>
<pre class="example" id="orgfe5d641">
(19998) address pointed to by p -&gt; 0x1047cd830
(19997) address pointed to by p -&gt; 0x10263d830
(19997) p =&gt; 1 addr -&gt; 0x10263d830
(19998) p =&gt; 1 addr -&gt; 0x1047cd830
(19997) p =&gt; 2 addr -&gt; 0x10263d830
(19998) p =&gt; 2 addr -&gt; 0x1047cd830
(19997) p =&gt; 3 addr -&gt; 0x10263d830
(19998) p =&gt; 3 addr -&gt; 0x1047cd830
(19997) p =&gt; 4 addr -&gt; 0x10263d830
(19998) p =&gt; 4 addr -&gt; 0x1047cd830
(19997) p =&gt; 5 addr -&gt; 0x10263d830
(19998) p =&gt; 5 addr -&gt; 0x1047cd830
</pre>

</details><p>In the textbook example, for both instances of the program, the memory was allocated to the same address, this was used to illustrate that each running program has its own private memory (<b>memory virtualization</b>, private <i>address space</i> that gets mapped to physical memory) rather than sharing physical memory with other programs.
</p>

<p>However for security purposes, <code>macOS</code> has enabled <code>address-space layout randomization</code> (ASLR) hence the different addresses for the two processes.
</p>
</div>
</div>
