org/notes/ostep.org
** Concurrency

#+name: include-common_threads
#+begin_src C
#ifndef __common_threads_h__
#define __common_threads_h__

#include <pthread.h>
#include <assert.h>
#include <sched.h>

#ifdef __linux__
#include <semaphore.h>
#endif

// wrapper around pthread_create() that ensures the return value is success
#define Pthread_create(thread, attr, start_routine, arg) assert(pthread_create(thread, attr, start_routine, arg) == 0);
#define Pthread_join(thread, value_ptr)                  assert(pthread_join(thread, value_ptr) == 0);

#define Pthread_mutex_lock(m)                            assert(pthread_mutex_lock(m) == 0);
#define Pthread_mutex_unlock(m)                          assert(pthread_mutex_unlock(m) == 0);
#define Pthread_cond_signal(cond)                        assert(pthread_cond_signal(cond) == 0);
#define Pthread_cond_wait(cond, mutex)                   assert(pthread_cond_wait(cond, mutex) == 0);

#define Mutex_init(m)                                    assert(pthread_mutex_init(m, NULL) == 0);
#define Mutex_lock(m)                                    assert(pthread_mutex_lock(m) == 0);
#define Mutex_unlock(m)                                  assert(pthread_mutex_unlock(m) == 0);
#define Cond_init(cond)                                  assert(pthread_cond_init(cond, NULL) == 0);
#define Cond_signal(cond)                                assert(pthread_cond_signal(cond) == 0);
#define Cond_wait(cond, mutex)                           assert(pthread_cond_wait(cond, mutex) == 0);

#ifdef __linux__
#define Sem_init(sem, value)                             assert(sem_init(sem, 0, value) == 0);
#define Sem_wait(sem)                                    assert(sem_wait(sem) == 0);
#define Sem_post(sem)                                    assert(sem_post(sem) == 0);
#endif // __linux__

#endif // __common_threads_h__
#+end_src

#+begin_src C :noweb no-export :tangle threads.c
#include <stdio.h>
#include <stdlib.h>
<<include-common>>
<<include-common_threads>>

volatile int counter = 0;
int loops;

void *worker(void *arg) {
    for (int i = 0; i < loops; i++) {
        counter++;
    }
    return NULL;
}

int main(int argc, char *argv[]) {
    if (argc != 2) {
        fprintf(stderr, "usage: threads <value>\n");
        exit(1);
    }
    loops = atoi(argv[1]);
    pthread_t p1, p2;
    // setbuf(stdout, NULL); // disable buffering
    printf("Initial value: %d\n", counter);

    Pthread_create(&p1, NULL, worker, NULL);
    Pthread_create(&p2, NULL, worker, NULL);
    // The pthread_join() function suspends execution of the calling thread (main)
    // until the target thread (p1/p2) terminates unless the target thread
    // has already terminated.
    Pthread_join(p1, NULL);
    Pthread_join(p2, NULL);

    printf("Final value: %d\n", counter);
    return 0;
}
#+end_src

Think of the thread as a function running withing the same memory space as other functions, with more than one of them active at a time. Here each thread starts running in the ~worker()~ routine which increments the counter for ~loops~ number of times. Given ~loops~ as =1000=, the expectation is that the final value of ~counter~ should be =2000= but that's not guaranteed.

#+begin_src sh :results output :exports both
gcc -o threads threads.c -I. -pthread
./threads 1000
wait
./threads 100000
wait
./threads 100000
wait
#+end_src

#+RESULTS[001571d2d00dd852c0df71dbb1e1084e79708e18]:
: Initial value: 0
: Final value: 1172
: Initial value: 0
: Final value: 100051
: Initial value: 0
: Final value: 101961

There's a different final ~counter~ value each time the program is executed, even with the same ~loops~ value. This is because the instructions of the ~worker()~ routine aren't *atomic* i.e. there are three separate instructions involved in updating the counter value:
1. Load counter value in register
2. Increment the value
3. Store it from register back to memory

If instructions aren't atomic and there are multiple concurrent threads executing withtin the same memory space, how can the program's correctness and efficiency be ensured?

To see the documentation for ~pthread_create~ check the following man page.

#+begin_src sh :results output :exports both
man 3 pthread_create | col -b | head -n 45
#+end_src

#+RESULTS[8fb48706e218970410914de9486c0f0cd0185c9d]:
#+begin_example
PTHREAD_CREATE(3)	   Library Functions Manual	     PTHREAD_CREATE(3)

NAME
     pthread_create – create a new thread

SYNOPSIS
     #include <pthread.h>

     int
     pthread_create(pthread_t *thread, const pthread_attr_t *attr,
	 void *(*start_routine)(void *), void *arg);

DESCRIPTION
     The pthread_create() function is used to create a new thread, with
     attributes specified by attr, within a process.  If attr is NULL, the
     default attributes are used.  If the attributes specified by attr are
     modified later, the thread's attributes are not affected.	Upon
     successful completion pthread_create() will store the ID of the created
     thread in the location specified by thread.

     The thread is created executing start_routine with arg as its sole
     argument.	If the start_routine returns, the effect is as if there was an
     implicit call to pthread_exit() using the return value of start_routine
     as the exit status.  Note that the thread in which main() was originally
     invoked differs from this.  When it returns from main(), the effect is as
     if there was an implicit call to exit() using the return value of main()
     as the exit status.

     Upon thread exit the storage for the thread must be reclaimed by another
     thread via a call to pthread_join().  Alternatively, pthread_detach() may
     be called on the thread to indicate that the system may automatically
     reclaim the thread storage upon exit.  The pthread_attr_setdetachstate()
     function may be used on the attr argument passed to pthread_create() in
     order to achieve the same effect as a call to pthread_detach() on the
     newly created thread.

     The signal state of the new thread is initialized as:

	   •   The signal mask is inherited from the creating thread.

	   •   The set of signals pending for the new thread is empty.

RETURN VALUES
     If successful, the pthread_create() function will return zero.  Otherwise
     an error number will be returned to indicate the error.
#+end_example

