docs/notes/ostep.html
<div id="outline-container-org687d5fa" class="outline-3">
<h3 id="org687d5fa">Concurrency</h3>
<div class="outline-text-3" id="text-org687d5fa">
<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#if</span><span class="font-lock-preprocessor-face font-lock-negation-char-face">n</span><span class="font-lock-preprocessor-face">def</span> __common_threads_h__
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-variable-name-face">__common_threads_h__</span>

<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;pthread.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;assert.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sched.h&gt;</span>

<span class="font-lock-preprocessor-face">#ifdef</span> __linux__
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;semaphore.h&gt;</span>
<span class="font-lock-preprocessor-face">#endif</span>

<span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">wrapper around pthread_create() that ensures the return value is success
</span><span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_create</span>(<span class="font-lock-variable-name-face">thread</span>, <span class="font-lock-variable-name-face">attr</span>, <span class="font-lock-variable-name-face">start_routine</span>, <span class="font-lock-variable-name-face">arg</span>) assert(pthread_create(thread, attr, start_routine, arg) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_join</span>(<span class="font-lock-variable-name-face">thread</span>, <span class="font-lock-variable-name-face">value_ptr</span>)                  assert(pthread_join(thread, value_ptr) == 0);

<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_mutex_lock</span>(<span class="font-lock-variable-name-face">m</span>)                            assert(pthread_mutex_lock(m) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_mutex_unlock</span>(<span class="font-lock-variable-name-face">m</span>)                          assert(pthread_mutex_unlock(m) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_cond_signal</span>(<span class="font-lock-variable-name-face">cond</span>)                        assert(pthread_cond_signal(cond) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Pthread_cond_wait</span>(<span class="font-lock-variable-name-face">cond</span>, <span class="font-lock-variable-name-face">mutex</span>)                   assert(pthread_cond_wait(cond, mutex) == 0);

<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Mutex_init</span>(<span class="font-lock-variable-name-face">m</span>)                                    assert(pthread_mutex_init(m, <span class="font-lock-constant-face">NULL</span>) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Mutex_lock</span>(<span class="font-lock-variable-name-face">m</span>)                                    assert(pthread_mutex_lock(m) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Mutex_unlock</span>(<span class="font-lock-variable-name-face">m</span>)                                  assert(pthread_mutex_unlock(m) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Cond_init</span>(<span class="font-lock-variable-name-face">cond</span>)                                  assert(pthread_cond_init(cond, <span class="font-lock-constant-face">NULL</span>) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Cond_signal</span>(<span class="font-lock-variable-name-face">cond</span>)                                assert(pthread_cond_signal(cond) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Cond_wait</span>(<span class="font-lock-variable-name-face">cond</span>, <span class="font-lock-variable-name-face">mutex</span>)                           assert(pthread_cond_wait(cond, mutex) == 0);

<span class="font-lock-preprocessor-face">#ifdef</span> __linux__
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Sem_init</span>(<span class="font-lock-variable-name-face">sem</span>, <span class="font-lock-variable-name-face">value</span>)                             assert(sem_init(sem, 0, value) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Sem_wait</span>(<span class="font-lock-variable-name-face">sem</span>)                                    assert(sem_wait(sem) == 0);
<span class="font-lock-preprocessor-face">#define</span> <span class="font-lock-function-name-face">Sem_post</span>(<span class="font-lock-variable-name-face">sem</span>)                                    assert(sem_post(sem) == 0);
<span class="font-lock-preprocessor-face">#endif</span> <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">__linux__
</span>
<span class="font-lock-preprocessor-face">#endif</span> <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">__common_threads_h__</span></code></pre>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
&lt;&lt;include-common&gt;&gt;
&lt;&lt;include-common_threads&gt;&gt;

<span class="font-lock-keyword-face">volatile</span> <span class="font-lock-type-face">int</span> counter = 0;
<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">loops</span>;

<span class="font-lock-type-face">void</span> *<span class="font-lock-function-name-face">worker</span>(<span class="font-lock-type-face">void</span> *<span class="font-lock-variable-name-face">arg</span>) {
    <span class="font-lock-keyword-face">for</span> (<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">i</span> = 0; i &lt; loops; i++) {
        counter++;
    }
    <span class="font-lock-keyword-face">return</span> <span class="font-lock-constant-face">NULL</span>;
}

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-keyword-face">if</span> (argc != 2) {
        fprintf(stderr, <span class="font-lock-string-face">"usage: threads &lt;value&gt;\n"</span>);
        exit(1);
    }
    loops = atoi(argv[1]);
    <span class="font-lock-type-face">pthread_t</span> <span class="font-lock-variable-name-face">p1</span>, <span class="font-lock-variable-name-face">p2</span>;
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">setbuf(stdout, NULL); // disable buffering
</span>    printf(<span class="font-lock-string-face">"Initial value: %d\n"</span>, counter);

    Pthread_create(&amp;p1, <span class="font-lock-constant-face">NULL</span>, worker, <span class="font-lock-constant-face">NULL</span>);
    Pthread_create(&amp;p2, <span class="font-lock-constant-face">NULL</span>, worker, <span class="font-lock-constant-face">NULL</span>);
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">The pthread_join() function suspends execution of the calling thread (main)
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">until the target thread (p1/p2) terminates unless the target thread
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">has already terminated.
</span>    Pthread_join(p1, <span class="font-lock-constant-face">NULL</span>);
    Pthread_join(p2, <span class="font-lock-constant-face">NULL</span>);

    printf(<span class="font-lock-string-face">"Final value: %d\n"</span>, counter);
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<p>Think of the thread as a function running withing the same memory space as other functions, with more than one of them active at a time. Here each thread starts running in the <code>worker()</code> routine which increments the counter for <code>loops</code> number of times. Given <code>loops</code> as <code>1000</code>, the expectation is that the final value of <code>counter</code> should be <code>2000</code> but that&rsquo;s not guaranteed.
</p>

<pre class="src src-sh"><code>gcc -o threads threads.c -I. -pthread
./threads 1000
<span class="font-lock-builtin-face">wait</span>
./threads 100000
<span class="font-lock-builtin-face">wait</span>
./threads 100000
<span class="font-lock-builtin-face">wait</span></code></pre>

<pre class="example">
Initial value: 0
Final value: 1172
Initial value: 0
Final value: 100051
Initial value: 0
Final value: 101961
</pre>


<p>There&rsquo;s a different final <code>counter</code> value each time the program is executed, even with the same <code>loops</code> value. This is because the instructions of the <code>worker()</code> routine aren&rsquo;t <b>atomic</b> i.e. there are three separate instructions involved in updating the counter value:
</p>
<ol class="org-ol">
<li>Load counter value in register</li>
<li>Increment the value</li>
<li>Store it from register back to memory</li>
</ol>

<p>If instructions aren&rsquo;t atomic and there are multiple concurrent threads executing withtin the same memory space, how can the program&rsquo;s correctness and efficiency be ensured?
</p>

<p>To see the documentation for <code>pthread_create</code> check the following man page.
</p>

<pre class="src src-sh"><code>man 3 pthread_create | col -b | head -n 45</code></pre>

<details>
<summary>Output</summary>
<pre class="example" id="orgea87a82">
PTHREAD_CREATE(3)	   Library Functions Manual	     PTHREAD_CREATE(3)

NAME
     pthread_create – create a new thread

SYNOPSIS
     #include &lt;pthread.h&gt;

     int
     pthread_create(pthread_t *thread, const pthread_attr_t *attr,
	 void *(*start_routine)(void *), void *arg);

DESCRIPTION
     The pthread_create() function is used to create a new thread, with
     attributes specified by attr, within a process.  If attr is NULL, the
     default attributes are used.  If the attributes specified by attr are
     modified later, the thread's attributes are not affected.	Upon
     successful completion pthread_create() will store the ID of the created
     thread in the location specified by thread.

     The thread is created executing start_routine with arg as its sole
     argument.	If the start_routine returns, the effect is as if there was an
     implicit call to pthread_exit() using the return value of start_routine
     as the exit status.  Note that the thread in which main() was originally
     invoked differs from this.  When it returns from main(), the effect is as
     if there was an implicit call to exit() using the return value of main()
     as the exit status.

     Upon thread exit the storage for the thread must be reclaimed by another
     thread via a call to pthread_join().  Alternatively, pthread_detach() may
     be called on the thread to indicate that the system may automatically
     reclaim the thread storage upon exit.  The pthread_attr_setdetachstate()
     function may be used on the attr argument passed to pthread_create() in
     order to achieve the same effect as a call to pthread_detach() on the
     newly created thread.

     The signal state of the new thread is initialized as:

	   •   The signal mask is inherited from the creating thread.

	   •   The set of signals pending for the new thread is empty.

RETURN VALUES
     If successful, the pthread_create() function will return zero.  Otherwise
     an error number will be returned to indicate the error.
</pre>

</details>
</div>
</div>
