org/notes/ostep.org
** Persistence

Final major theme of /persistence/ relates to determinate data storage and not be dependent on /volatile/ memory. The software in the OS that manages the disk is called /file system/. Unlike CPU and memory abstractions, the expectation when is comes to files is that the user would *want to share* the data in files with processes hence there is no need of virtualization of disk.

#+begin_src C :noweb no-export :tangle io.c
#include <stdio.h>
#include <unistd.h>
#include <assert.h>
#include <fcntl.h>
#include <sys/types.h>

int main(int argc, char *argv[]) {
    // The file name specified by path is opened for reading and/or writing, as
    // specified by the argument oflag; the file descriptor is returned to the
    // calling process.
    // O_WRONLY: open for writing only (O_RONLY, O_RDWR, O_SEARCH, O_EXEC)
    // O_CREAT: create file if not exist, O_TRUNC: truncate size to 0 if exist
    // S_IRWXU:  00700 user (file owner) has read, write & execute permission
    int fd = open("/tmp/file_ostep", O_WRONLY|O_CREAT|O_TRUNC, S_IRWXU);
    // If successful, open() returns a non-negative integer, termed a file
    // descriptor.  It returns -1 on failure, and sets errno to indicate the
    // error.
    assert(fd > -1);
    // write() attempts to write nbyte of data to the object referenced by the
    // descriptor fd from the buffer pointed to by buf.  Upon successful completion
    // the number of bytes which were written is returned otherwise -1.
    int rc = write(fd, "hello world\n", 12); // 12 = nbyte
    assert(rc == 12);
    // The close() call deletes a descriptor from the per-process object
    // reference table.  If this is the last reference to the underlying object,
    // the object will be deactivated. `man 2 close` 
    close(fd);
    return 0;
}
#+end_src

#+begin_src sh :results output :exports both
gcc -o io io.c
./io
wait
cat /tmp/file_ostep
#+end_src

#+RESULTS[ebeda04c400df074f48cb79bd8990fb50c778510]:
: hello world

Here, ~open()~, ~write()~ and ~close()~ are /system calls/ that are routed to the /file system/ which handles these requests and returns their response to the user.

** Discussion links

- SingularityOS: https://en.wikipedia.org/wiki/Singularity_(operating_system)#Security_design
- Ben Eater: https://www.youtube.com/playlist?list=PLowKtXNTBypFbtuVMUVXNR0z1mu7dp7eH
- sel4: https://sel4.systems/About/whitepaper.html
