docs/notes/ostep.html
<div id="outline-container-org512bd4c" class="outline-3">
<h3 id="org512bd4c">Persistence</h3>
<div class="outline-text-3" id="text-org512bd4c">
<p>Final major theme of <i>persistence</i> relates to determinate data storage and not be dependent on <i>volatile</i> memory. The software in the OS that manages the disk is called <i>file system</i>. Unlike CPU and memory abstractions, the expectation when is comes to files is that the user would <b>want to share</b> the data in files with processes hence there is no need of virtualization of disk.
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;assert.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;fcntl.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/types.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">The file name specified by path is opened for reading and/or writing, as
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">specified by the argument oflag; the file descriptor is returned to the
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">calling process.
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">O_WRONLY: open for writing only (O_RONLY, O_RDWR, O_SEARCH, O_EXEC)
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">O_CREAT: create file if not exist, O_TRUNC: truncate size to 0 if exist
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">S_IRWXU:  00700 user (file owner) has read, write &amp; execute permission
</span>    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">fd</span> = open(<span class="font-lock-string-face">"/tmp/file_ostep"</span>, O_WRONLY|O_CREAT|O_TRUNC, S_IRWXU);
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">If successful, open() returns a non-negative integer, termed a file
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">descriptor.  It returns -1 on failure, and sets errno to indicate the
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">error.
</span>    assert(fd &gt; -1);
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">write() attempts to write nbyte of data to the object referenced by the
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">descriptor fd from the buffer pointed to by buf.  Upon successful completion
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">the number of bytes which were written is returned otherwise -1.
</span>    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = write(fd, <span class="font-lock-string-face">"hello world\n"</span>, 12); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">12 = nbyte
</span>    assert(rc == 12);
    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">The close() call deletes a descriptor from the per-process object
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">reference table.  If this is the last reference to the underlying object,
</span>    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">the object will be deactivated. `man 2 close` 
</span>    close(fd);
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="src src-sh"><code>gcc -o io io.c
./io
<span class="font-lock-builtin-face">wait</span>
cat /tmp/file_ostep</code></pre>

<pre class="example">
hello world
</pre>


<p>Here, <code>open()</code>, <code>write()</code> and <code>close()</code> are <i>system calls</i> that are routed to the <i>file system</i> which handles these requests and returns their response to the user.
</p>
</div>
</div>
<div id="outline-container-org8ba125f" class="outline-3">
<h3 id="org8ba125f">Discussion links</h3>
<div class="outline-text-3" id="text-org8ba125f">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Singularity_(operating_system)#Security_design">SingularityOS</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLowKtXNTBypFbtuVMUVXNR0z1mu7dp7eH">Ben Eater Video</a></li>
<li><a href="https://sel4.systems/About/whitepaper.html">sel4</a></li>
</ul>
</div>
</div>
</div>
</div>
<footer id="postamble" class="status">
&copy; 2026 . Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</footer>
</body>
</html>
